[{"title": "Vital Sign Measurement Across the Lifespan - 1st Canadian edition", "catagories": ["Ancillary Resources"], "authors": "Jennifer L. Lapum, Margaret Verkuyl, Wendy Garcia, Oona St-Amant, Andy Tan, Ryerson University", "date": "May 3, 2018", "description": "Description: The purpose of this textbook is to help learners develop best practices in vital sign measurement. Using a multi-media approach, it will provide opportunities to read about, observe, practice, and test vital sign measurement.", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=feacda80-4fc1-40a5-b713-d6be6a73abe4&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Exploring Movie Construction and Production", "catagories": ["Adopted"], "authors": "John Reich, SUNY Genesee Community College", "date": "May 2, 2018", "description": "Description: Exploring Movie Construction and Production contains eight chapters of the major areas of film construction and production. The discussion covers theme, genre, narrative structure, character portrayal, story, plot, directing style, cinematography, and editing. Important terminology is defined and types of analysis are discussed and demonstrated. An extended example of how a movie description reflects the setting, narrative structure, or directing style is used throughout the book to illustrate ...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=19892992-ae43-48c4-a832-59faa1d7108b&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Project Management", "catagories": ["Adopted", "Ancillary Resources"], "authors": "Adrienne Watt", "date": "May 1, 2018", "description": "Description: This book covers the basics of project management. This includes the process of initiation, planning, execution, control and close out that all projects share.\n\nThis book has been adapted by the author as of August 15, 2014. The adaptation includes Canadianized content, PowerPoints, Audio Files, and Chapter Questions, which are located in the book's appendixes.", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=8678fbae-6724-454c-a796-3c6667d826be&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Principles of Macroeconomics - 2e: OpenStax", "catagories": ["Faculty reviewed", "Accessible", "Ancillary Resources"], "authors": "Steven A. Greenlaw, University of Mary Washington, David Shapiro, Pennsylvania State University, Timothy Taylor, Macalester College", "date": "May 1, 2018", "description": "Description: Principles of Macroeconomics 2e covers the scope and sequence of most introductory economics courses. The text includes many current examples, which are handled in a politically equitable way. The outcome is a balanced approach to the theory and application of economics concepts. The second edition has been thoroughly revised to increase clarity, update data and current event impacts, and incorporate the feedback from many reviewers and adopters.", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=66bedfc5-48eb-4bb6-bd26-0f1f784c13e4&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Principles of Microeconomics - 2e: OpenStax", "catagories": ["Faculty reviewed", "Accessible", "Ancillary Resources"], "authors": "Timothy Taylor, Macalester College, Steven A. Greenlaw, University of Mary Washington, David Shapiro, Pennsylvania State University", "date": "May 1, 2018", "description": "Description: Principles of Microeconomics 2e covers the scope and sequence of most introductory microeconomics courses. The text includes many current examples, which are handled in a politically equitable way. The outcome is a balanced approach to the theory and application of economics concepts. The second edition has been thoroughly revised to increase clarity, update data and current event impacts, and incorporate the feedback from many reviewers and adopters.", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=b7ed9d7e-0f41-41ee-8c8f-25887fa5056c&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Principles of Economics - 2e: OpenStax", "catagories": ["Faculty reviewed", "Accessible", "Ancillary Resources"], "authors": "Steven A. Greenlaw, University of Mary Washington, David Shapiro, Pennsylvania State University, Timothy Taylor, Macalester College", "date": "May 1, 2018", "description": "Description: Principles of Economics 2e (2nd edition) covers the scope and sequence of requirements for a two-semester introductory economics course. The authors take a balanced approach to micro-and macroeconomics, to both Keynesian and classical views, and to the theory and application of economics concepts. The text also includes many current examples, which are handled in a politically equitable way. The second edition has been thoroughly revised to increase clarity, update data and current event impact...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=8fcf63de-feea-4a46-b98c-34d649d3d9a0&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Biology - 2e: OpenStax", "catagories": ["Faculty reviewed", "Accessible", "Ancillary Resources"], "authors": "Mary Ann Clark, Texas Wesleyan University, Jung Choi, Georgia Institute of Technology, Matthew Douglas, Grand Rapids Community College", "date": "May 1, 2018", "description": "Description: Biology 2e is designed to cover the scope and sequence requirements of a typical two-semester biology course for science majors. The text provides comprehensive coverage of foundational research and core biology concepts through an evolutionary lens. Biology includes rich features that engage students in scientific inquiry, highlight careers in the biological sciences, and offer everyday applications. The book also includes various types of practice and homework questions that help students und...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=3ffb8117-dc5a-4197-b0ed-b0edef51d17a&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Nutrition and Labelling for the Canadian Baker", "catagories": ["Accessible", "Ancillary Resources"], "authors": "The BC Cook Articulation Committee, go2HR", "date": "Apr 30, 2018", "description": "Description: This book is intended to give students a basic understanding of nutritional information and labelling in the baking industry. In particular, there is a focus on Canadian regulations regarding labelling and merchandising of baked goods, as well as baking for customers with special diets, allergies, and intolerances.\n\nNutrition and Labelling for the Canadian Baker is one of a series of Culinary Arts books developed to support the training of students and apprentices in British Columbia’s food ser...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=3bb22917-ec4b-4ef5-b649-84c296a9765a&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Canadian History: Post-Confederation", "catagories": ["Adopted", "Ancillary Resources"], "authors": "John Douglas Belshaw, Thompson Rivers University", "date": "Apr 30, 2018", "description": "Description: This textbook introduces aspects of the history of Canada since Confederation. “Canada” in this context includes Newfoundland and all the other parts that come to be aggregated into the Dominion after 1867. Much of this text follows thematic lines. Each chapter moves chronologically but with alternative narratives in mind. What Aboriginal accounts must we place in the foreground? Which structures (economic or social) determine the range of choices available to human agents of history? What envi...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=504e63e2-0742-4d47-b763-49728f8b88e3&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "BC Reads: Adult Literacy Fundamental English - Reader 4", "catagories": ["Faculty reviewed", "Adopted"], "authors": "Shantel Ivits, Vancouver Community College", "date": "Apr 30, 2018", "description": "Description: This reader contains nine original stories written specifically for adults, and is designed to accompany the BC Reads: Adult Literacy Fundamental English - Course Pack 4. This level 4 reader, one of a series of six readers, is roughly equivalent to grades 4.5 to 6 in the K-12 system. New vocabulary are set in bold throughout each story, and then summarized and defined in a Glossary found in the appendix. Font size and line spacing can be adjusted in the online view, and have been enhanced for t...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=22064af6-a82e-4d05-a529-0530dc4f6581&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "BC Reads: Adult Literacy Fundamental English - Course Pack 4", "catagories": ["Adopted", "Ancillary Resources"], "authors": "Shantel Ivits, Vancouver Community College", "date": "Apr 30, 2018", "description": "Description: This course pack is designed to meet the learning outcomes for Adult Literacy Fundamental English Level 4 (roughly equivalent to grades 4.5 to 6 in the K-12 system). Every chapter includes a level-appropriate, high-interest reading of between 400 and 500 words. The readings are freely available in a separate reader with convenient links to the readings in each chapter of this course pack. Font size and line spacing can be adjusted in the online view, and have been enhanced for the print and PDF...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=ead724b0-1d6c-4ab7-b6c9-62cb574d4de7&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Introduction to Tourism and Hospitality in BC", "catagories": ["Faculty reviewed", "Adopted", "Accessible", "Ancillary Resources"], "authors": "Morgan Westcott, LinkBC, Geoffrey Bird, Royal Roads University, Peter Briscoe, Ray Freeman, Royal Roads University, Kelly Glazer, Keith Henry, Terry Hood, Heather Knowles, Micki McCartney, Vancouver Island University, Donna Owens, George Brown College, Lynda Robinson, Vancouver Island University, Eugene Thomlinson, Royal Roads University, Griff Tripp, Don Webster, Capilano University, Rebecca Wilson-Mah, Royal Roads University", "date": "Apr 30, 2018", "description": "Description: This textbook is an introduction to the tourism and hospitality industry in British Columbia, and is written with a first year college and university audience in mind. It is a collaborative work with input from educators, industry leaders, employers, and past graduates of BC’s tourism and hospitality management programs. All chapters have been reviewed by experts in the field. Each chapter is organized thematically moving from a global, then national, and finally provincial context. Chapters co...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=fdb68dba-0709-4778-a2f7-af8bafd84fa9&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Physical Geology", "catagories": ["Adopted", "Accessible"], "authors": "Steven Earle, Thompson Rivers University", "date": "Apr 30, 2018", "description": "Description: Physical Geology is a comprehensive introductory text on the physical aspects of geology, including rocks and minerals, plate tectonics, earthquakes, volcanoes, glaciation, groundwater, streams, coasts, mass wasting, climate change, planetary geology and much more.  It has a strong emphasis on examples from western Canada, especially British Columbia, and also includes a chapter devoted to the geological history of western Canada.  The book is a collaboration of faculty from Earth Science depar...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=52166cd1-e380-4e1b-9a6f-d891936e4749&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Global Women's Issues: Women in the World Today, extended version", "catagories": ["Faculty reviewed", "Adopted", "Ancillary Resources"], "authors": "United States Department of State, Bureau of International Information Programs , Dr. Janni Aragon, Dr. Mariel Miller, University of Victoria", "date": "Apr 30, 2018", "description": "Description: We cannot solve global challenges unless women participate fully in efforts to find solutions. Female participation in the private sector is a crucial economic driver for societies worldwide. Economic security benefits every facet of a woman’s life, with positive effects on the health, education and vitality of families. Learn about women who are changing their societies for the better. This book is based on the twelve critical areas of concern identified in the Beijing Declaration and Platform...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=47e557eb-f65f-4586-b08f-ae4600504177&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Introductory Business Statistics with Interactive Spreadsheets - 1st Canadian Edition", "catagories": ["Faculty reviewed"], "authors": "Mohammad Mahbobi, Thompson Rivers University, Thomas K. Tiemann, Elon University", "date": "Apr 30, 2018", "description": "Description: \"Introductory Business Statistics with Interactive Spreadsheets - 1st Canadian Edition\" is an adaptation of Thomas K. Tiemann's book, \"Introductory Business Statistics\". In addition to covering basics such as populations, samples, the difference between data and information, and sampling distributions, descriptive statistics and frequency distributions, normal and t-distributions, hypothesis testing, t-tests, f-tests, analysis of variance, non-parametric tests, and regression basics, the follow...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=2903c1ea-7e71-4db4-9c02-071616a65f1f&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Speaking and Writing Punjabi", "catagories": [], "authors": "Ranbir Johal, Kwantlen Polytechnic University", "date": "Apr 30, 2018", "description": "Description: Speaking and Writing Punjabi, by Ranbir Johal, is an introductory Punjabi textbook/workbook. This textbook is organized around a communicative approach with each chapter containing dialogues and exercises based on topics such as greetings and introductions, family and friends, daily routine, food and shopping.  Ranbir Johal teaches Punjabi language and South Asian content courses at Kwantlen Polytechnic University.", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=fb061187-187c-4272-8ba1-5b3993dfc0e8&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "University Physics Volume 3: OpenStax", "catagories": ["Adopted", "Accessible", "Ancillary Resources"], "authors": "Samuel J. Ling, Truman State University, Jeff Sanny, Loyola Marymount University, William Moebs (retired), Loyola Marymount University", "date": "Apr 27, 2018", "description": "Description: University Physics is a three-volume collection that meets the scope and sequence requirements for two- and three-semester calculus-based physics courses. Volume 1 covers mechanics, sound, oscillations, and waves. Volume 2 covers thermodynamics, electricity and magnetism, and Volume 3 covers optics and modern physics. This textbook emphasizes connections between between theory and application, making physics concepts interesting and accessible to students while maintaining the mathematical rigo...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=8b94e5f6-8d63-40fe-9028-7fc50b70a3bb&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Combinatorics: Enumeration, Graph Theory, and Design Theory", "catagories": [], "authors": "Joy Morris, University of Lethbridge", "date": "Apr 27, 2018", "description": "Description: Combinatorics provides an introduction to enumeration, graph theory, and design theory. It is aimed at upper-level undergraduate students and the exercises expect some mathematical sophistication, including a reasonable ability to construct proofs. The text is designed to be used in an undergraduate course, but could be suitable for independent study by a student with some mathematical background and understanding of proofs. It does not assume any background knowledge of combinatorics.", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=db971e1f-dee2-4032-99b4-a9115d3f9ce6&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Biology: OpenStax", "catagories": ["Faculty reviewed", "Adopted", "Accessible", "Ancillary Resources"], "authors": "Yael Avissar, Rhode Island College, Jung Choi, Georgia Institute of Technology, Jean DeSaix, University of North Carolina, Vladimir Jurukovski, Suffolk County Community College, Robert Wise, University of Wisconsin, Connie Rye, East Mississippi Community College", "date": "Apr 27, 2018", "description": "Description: THIS BOOK WILL BE ARCHIVED ON JUNE 1, 2018 AS IT HAS BEEN REPLACED BY A NEW EDITION . Published by OpenStax College, Biology is designed for multi-semester biology courses for science majors. It is grounded on an evolutionary basis and includes features that highlight careers in the biological sciences and everyday applications of the concepts at hand. To meet the needs of today’s instructors and students, some content has been strategically condensed while maintaining the overall scope and cov...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=561e303a-5a74-4bfe-af71-e884daece4e5&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}, {"title": "Naming the Unnamable: An Approach to Poetry for New Generations", "catagories": [], "authors": "Michelle Bonczek Evory. Western Michigan University", "date": "Apr 27, 2018", "description": "Description: Informed by a writing philosophy that values both spontaneity and discipline, Michelle Bonczek Evory’s Naming the Unnameable: An Approach to Poetry for New Generations  offers practical advice and strategies for developing a writing process that is centered on play and supported by an understanding of America’s rich literary traditions. With consideration to the psychology of invention, Bonczek Evory provides students with exercises aimed to make writing in its early stages a form of play that ...[more]", "link": "https://open.bccampus.ca/find-open-textbooks/?uuid=8880b4d1-7f62-42fc-a912-3015f216f195&contributor=&keyword=&subject=", "source": "BC Campus", "type": "Textbook"}]